package thisiscodingtest;

/**
 * 캐릭터가 육지로 이동해야되는 경로를 찾는 문제
 * 캐릭터는 맵의 위치가 정해져 있고 바라보고 서 있는 방향은 정해져 있다.
 * 캐릭터는 시계방향 90도로 움직일수 있다.
 * 캐릭터는 시계방향으로 움직이면서 육지에 도달하면 종료된다.
 * 0. 이차원 배열을 만든 뒤 맵의 육지와 바다를 저장한다
 * 1. 캐릭터의 위치를 저장하는 배열을 만든다.
 * 2. 캐릭터가 안가본 위치와 가본 위치를 구별 하기 위해 참,거짓 이차원 배열을 만든다.
 * 3. 동, 서, 남, 북 값을 각각 배열에 저장 하고 캐릭터 가 보고 있는 방향을 돌려주는 함수를 만든다.
 * 4. 캐릭터의 위치를 저장하는 배열을 이용하여 캐릭터의 위치를 저장하고 캐릭터가 보고 있는 방향을 see 변수에 저장한다.
 * 5. 한 방향씩 돌아가면서 찾아본다`
 * 6.
 * 7.
 */

public class this4_3 {

    public static void main(String[] args) {

    }
}
